Revit 2024 API
ParameterTypeId.WallBaseConstraint Property
 "Base Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId WallBaseConstraint { get; }
Visual Basic
Public Shared ReadOnly Property WallBaseConstraint As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WallBaseConstraint {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace